In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np
import os.path as path

# File to Load (Remember to Change These)
file_to_load = path.join("Resources", "purchase_data.csv")

# Read Purchasing File and store into Pandas data frame
purchase_df = pd.read_csv(file_to_load)

purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [2]:
unique_player_df = purchase_df.drop_duplicates(subset="SN", keep="first")

unique_player_count = unique_player_df.shape[0]

print(f"Total unique players: {unique_player_count}")

Total unique players: 576

In [3]:
unique_item_df = purchase_df.drop_duplicates(subset="Item ID")

unique_item_count = unique_item_df.shape[0]

total_purchase_count = purchase_df.shape[0]

total_revenue = round(purchase_df.sum(axis=0)["Price"], 2)

average_sale_price = round((total_revenue / total_purchase_count), 2)

columns = ["Number of Unique Items", "Average Purchase Price", "Total Number of Purchases", "Total Revenue"]

total_purchases_data = [
    unique_item_count,
    average_sale_price,
    total_purchase_count,
    total_revenue
]

total_purchases_df = pd.DataFrame(data=[total_purchases_data], columns=columns)

total_purchases_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,183,3.05,780,2379.77

In [4]:
male_df = purchase_df[purchase_df["Gender"]=="Male"]
unique_male_df = male_df.drop_duplicates(subset="SN", keep="first")
unique_male_count = unique_male_df.shape[0]
male_percent = round((unique_male_count / unique_player_count * 100), 2)

female_df = purchase_df[purchase_df["Gender"]=="Female"]
unique_female_df = female_df.drop_duplicates(subset="SN", keep="first")
unique_female_count = unique_female_df.shape[0]
female_percent = round((unique_female_count / unique_player_count * 100), 2)

other_df = purchase_df[purchase_df["Gender"]=="Other / Non-Disclosed"]
unique_other_df = other_df.drop_duplicates(subset="SN", keep="first")
unique_other_count = unique_other_df.shape[0]
other_percent = round((unique_other_count / unique_player_count * 100), 2)

player_gender_data = [
    unique_male_count,
    male_percent,
    unique_female_count,
    female_percent,
    unique_other_count,
    other_percent,
]

columns = ["Male player count",
    "Male player percent",
    "Female player count",
    "Female player percent",
    "Other player count",
    "Other player percent"
]

player_gender_df = pd.DataFrame(data=[player_gender_data], columns=columns)

player_gender_df

,Male player count,Male player percent,Female player count,Female player percent,Other player count,Other player percent
0,484,84.03,81,14.06,11,1.91

In [5]:
male_purchase_count = male_df.shape[0]
male_revenue = round(male_df.sum(axis=0)["Price"], 2)
male_average_purchase = round((male_revenue / male_purchase_count), 2)
male_total_revenue_per_person_df = male_df.groupby("SN")["Price"].sum()
male_purchases_per_person_count = male_df.groupby("SN")["Price"].count()
male_average_revenue_per_person_df = round((male_total_revenue_per_person_df / male_purchases_per_person_count), 2)
male_average_revenue_per_person = round((male_total_revenue_per_person_df.sum()/unique_male_count), 2)

female_purchase_count = female_df.shape[0]
female_revenue = round(female_df.sum(axis=0)["Price"], 2)
female_average_purchase = round((female_revenue / female_purchase_count), 2)
female_total_revenue_per_person_df = female_df.groupby("SN")["Price"].sum()
female_purchases_per_person_count = female_df.groupby("SN")["Price"].count()
female_average_revenue_per_person_df = round((female_total_revenue_per_person_df / female_purchases_per_person_count), 2)
female_average_revenue_per_person = round((female_total_revenue_per_person_df.sum()/unique_female_count), 2)

other_purchase_count = other_df.shape[0]
other_revenue = round(other_df.sum(axis=0)["Price"], 2)
other_average_purchase = round((other_revenue / other_purchase_count), 2)
other_total_revenue_per_person_df = other_df.groupby("SN")["Price"].sum()
other_purchases_per_person_count = other_df.groupby("SN")["Price"].count()
other_average_revenue_per_person_df = round((other_total_revenue_per_person_df / other_purchases_per_person_count), 2)
other_average_revenue_per_person = round((other_total_revenue_per_person_df.sum()/unique_other_count), 2)

male_purchase_data = [
    male_purchase_count,
    male_average_purchase,
    male_revenue,
    male_average_revenue_per_person
]

female_purchase_data = [
    female_purchase_count,
    female_average_purchase,
    female_revenue,
    female_average_revenue_per_person
]

other_purchase_data = [
    other_purchase_count,
    other_average_purchase,
    other_revenue,
    other_average_revenue_per_person
]

male_purchase_columns = [
    "Number of sales to men",
    "Average men's purchase price",
    "Total revenue from men",
    "Average revenue per male"
]

female_purchase_columns = [
    "Number of sales to women",
    "Average women's purchase price",
    "Total revenue from women",
    "Average revenue per female"
]

other_purchase_columns = [
    "Number of sales to other",
    "Average other's purchase price",
    "Total revenue from other",
    "Average revenue per other"
]

male_purchase_df = pd.DataFrame(data=[male_purchase_data], columns=male_purchase_columns)
female_purchase_df = pd.DataFrame(data=[female_purchase_data], columns=female_purchase_columns)
other_purchase_df = pd.DataFrame(data=[other_purchase_data], columns=other_purchase_columns)

In [6]:
male_purchase_df

,Number of sales to men,Average men's purchase price,Total revenue from men,Average revenue per male
0,652,3.02,1967.64,4.07

In [7]:
female_purchase_df

,Number of sales to women,Average women's purchase price,Total revenue from women,Average revenue per female
0,113,3.2,361.94,4.47

In [8]:
other_purchase_df

,Number of sales to other,Average other's purchase price,Total revenue from other,Average revenue per other
0,15,3.35,50.19,4.56

In [9]:
print(purchase_df["Age"].min())
print(purchase_df["Age"].max())

bins = []
names = []
i = purchase_df["Age"].min() - purchase_df["Age"].min() % 4
loop_count = 0
while i < purchase_df["Age"].max():
    i = loop_count * 4
    
    bins.append(i)
    
    if loop_count != 0:
        if loop_count == 1:
            names.append(f"<{i-4}")
        else:
            names.append(f"{i-4} - {i}")
    else:
        print()

    loop_count = loop_count + 1

purchase_df["Bins"] = pd.cut(purchase_df["Age"], bins, labels=names)
purchase_df.head()

7
45

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Bins
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,16 - 20
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,36 - 40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20 - 24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20 - 24
4,4,Iskosia90,23,Male,131,Fury,1.44,20 - 24

In [20]:
purchase_df.groupby("Bins")["Bins"].agg(["count"])

         count
Bins
<0           0
4 - 8       17
8 - 12      28
12 - 16     71
16 - 20    170
20 - 24    266
24 - 28     88
28 - 32     63
32 - 36     42
36 - 40     28
40 - 44      6
44 - 48      1